export const answerData = [
  {
    id: 1,
    type: "INTJ",
    answer_1: "내 손안의 마트",
    answer_2: "방구석 쇼퍼",
    contentTitle: "쇼핑은 무조건 집에서",
  },

  {
    id: 2,
    type: "INTP",
    answer_1: "누구보다 빠르다",
    answer_2: "먹리어답터",
    contentTitle: "새로운 음식은 내가 먼저",
  },

  {
    id: 3,
    type: "ENTJ",
    answer_1: "쇼핑도 철저하게",
    answer_2: "장보기 매니저",
    contentTitle: "꼼꼼히 따져봐야지!",
  },

  {
    id: 4,
    type: "ENTP",
    answer_1: "충동 구매의 본좌",
    answer_2: "장바구니 지름신",
    contentTitle: "다 질러버렷!",
  },

  {
    id: 5,
    type: "INFJ",
    answer_1: "라면은 푸라면, 과자는 새우과자",
    answer_2: "커피는 맥심...",
    contentTitle: "답은 이미 정해져 있어",
  },

  {
    id: 6,
    type: "INFP",
    answer_1: "따뜻하다 못해 뜨거운",
    answer_2: "당근 온도 99℃",
    contentTitle: "좋은 건 함께하고 싶어!",
  },

  {
    id: 7,
    type: "ENFJ",
    answer_1: "꼼꼼히 따져봐야지",
    answer_2: "최저가 AI",
    contentTitle: "쇼핑계의 알파고",
  },

  {
    id: 8,
    type: "ENFP",
    answer_1: "장바구니 가-득",
    answer_2: "마트 만수르",
    contentTitle: "쇼핑은 나의 즐거움!",
  },

  {
    id: 9,
    type: "ISTJ",
    answer_1: "가격 비교는 철저히",
    answer_2: "인간 체크리스트",
    contentTitle: "꼼꼼히 따져봐야지!",
  },

  {
    id: 10,
    type: "ISFJ",
    answer_1: "내 편은 내가 챙긴다!",
    answer_2: "내편 내챙",
    contentTitle: "가족을 생각하는 장보기",
  },

  {
    id: 11,
    type: "ESTJ",
    answer_1: "상품 비교는 나의 힘!",
    answer_2: "장보기 프로",
    contentTitle: "꼼꼼히 따져봐야지!",
  },

  {
    id: 12,
    type: "ESFJ",
    answer_1: "이 곳은 나의 구역",
    answer_2: "마트의 콜럼버스",
    contentTitle: "이 상품, 놓치고 싶지 않아!",
  },

  {
    id: 13,
    type: "ISTP",
    answer_1: "딱 필요한 만큼만",
    answer_2: "슬기로운 쇼핑생활",
    contentTitle: "꼼꼼히 따져봐야지!",
  },

  {
    id: 14,
    type: "ISFP",
    answer_1: "나도 모르는 나의 쇼핑 취향",
    answer_2: "4차원 쇼퍼",
    contentTitle: "아낌없이 주는 나무",
  },

  {
    id: 15,
    type: "ESTP",
    answer_1: "나한테 물어보고 사!",
    answer_2: "먹잘알 먹리더",
    contentTitle: "새로운 음식은 내가 먼저",
  },

  {
    id: 16,
    type: "ESFP",
    answer_1: "이것 꼭 먹어봐! 저것 꼭 먹어봐!",
    answer_2: "본투비 먹보",
    contentTitle: "하루종일 부스럭-부스럭-",
  },
];

export const mbti = [
  {
    id: 1,
    type: "INTJ",
    contents: [
      "필요 하지 않은 상품에 도전이나 낭비를 하지 않습니다.",
      "온라인 장보기를 선호하며 가격 비교나 혜택 적용을 중요시 합니다.",
      "시간을 낭비하지 않고 효율적으로 쇼핑하는 타입으로, 일정 시간 안에 최적의 제품을 찾기 위해 여러 곳을 빠르게 탐색합니다.",
      "나를 위한 적당한 사치를 하기도 합니다.",
    ],
  },

  {
    id: 2,
    type: "INTP",
    contents: [
      "내가 즐겨 먹던 상품이 아니라도 새로운 상품이 나오면 시도해보는 편입니다.",
      "마트를 갈 때 미리 정보를 검색해보지만, 사야할 상품을 정해두진 않습니다.",
      "적은 금액의 최상의 제품을 찾는 것을 좋아합니다.",
      "정보를 쉽게 얻을 수 있고, 편리하게 구매 가능한 온라인 환경을 선호합니다.",
      "장 봐 온 물건은 바로 정리하지만 매우 귀찮아 합니다.",
    ],
  },

  {
    id: 3,
    type: "ENTJ",
    contents: [
      "남들이 바가지 쓰는 것은 잘 못 봅니다. 그래서 친구가 물건을 살 때 같이 따져봅니다.",
      "내가 고른 것은 고품질의 제일 좋은 상품이라고 생각합니다.",
      "마트에서 카트에 담을 때도 꼼꼼히 따져 고릅니다.",
      "최대한 빠르게 원하는 제품을 구입하고, 남는 시간을 다른 일에 쓰려 합니다.",
    ],
  },

  {
    id: 4,
    type: "ENTP",
    contents: [
      "왠지 다 필요한 느낌이라 장바구니에 물건 담는 것을 멈출 수가 없습니다.",
      "나를 위한 소비에는 아낌이 없습니다.",
      "모자란 것 보다는 남는게 낫습니다.",
      "사서 좋으면 개이득이고 아님 말고~ 쿨한 성격입니다.",
      "새로운 제품을 시도하고, 기존의 제품보다 더 나은 제품을 찾으려 합니다.",
    ],
  },

  {
    id: 5,
    type: "INFJ",
    contents: [
      "내가 즐겨찾는 상품이 정해져 있고, 잘 바꾸지 않습니다.",
      "상품 구매에 따른 즐거움, 행복과 같은 감정 가치의 크기가 중요합니다.",
      "국밥엔 소면, 떡볶이엔 핫도그같은 나만의 먹레시피가 있습니다.",
      "환경에 대한 책임감이 높고, 재사용이나 재활용이 가능한 제품을 선호합니다.",
      "제품의 품질, 원재료, 제조 과정등을 철저하게 검토하여 구매 결정을 합니다.",
    ],
  },

  {
    id: 6,
    type: "INFP",
    contents: [
      "좋은 상품이 있다면 내 주변에 아낌 없이 나눕니다.",
      "사회적 책임을 가지고 환경을 고려하여 상품을 구매합니다.",
      "제품이 가지는 미적 가치를 중요시 합니다.",
      "독창적인 스타일을 추구하며, 다른 사람들이 가지고 있지 않은 제품을 선호합니다.",
    ],
  },

  {
    id: 7,
    type: "ENFJ",
    contents: [
      "상품 비교는 나의 힘! 가격부터 품질까지 꼼꼼히 비교합니다.",
      "가성비가 좋은 상품을 선호합니다.",
      "상대적으로 비싼 상품을 구매하더라도 자신의 스타일을 드러내고 싶어합니다.",
      "제품의 품질, 디자인 등을 중요시 합니다.",
    ],
  },

  {
    id: 8,
    type: "ENFP",
    contents: [
      "일단 사고 보는 성격!",
      "쇼핑은 나의 즐거움, 장바구니 채우기는 곧 나의 행복입니다.",
      "온라인으로 가격을 고려하는 동시에 마트에서 직접 판단하며 최적의 상품을 찾습니다.",
      "쇼핑도 다른 경험 중 하나로 보고 다양한 스타일과 새로운 제품, 브랜드를 찾는 것을 즐깁니다.",
      "구매에 대한 결정을 빠르게 하는 타입입니다.",
    ],
  },

  {
    id: 9,
    type: "ISTJ",
    contents: [
      "계획적인 쇼핑을 선호합니다.",
      "가격비교는 나의 힘! 절약정신이 투철합니다.",
      "쿠폰, 할인카드 등 다양한 혜택을 알뜰하게 챙깁니다.",
      "사고 싶은 것이 생겨도 즉흥적으로 사는 일이 적습니다.",
      "돈이 조금 더 들더라도 믿을 수 있는 곳에서 구매합니다.",
      "좋은 상품을 경험 하게되면 단골 가게가 되며, 신뢰가 깨지는 순간 다시는 가지 않습니다.",
    ],
  },

  {
    id: 10,
    type: "ISFJ",
    contents: [
      "내가 사랑하는 나의 가족에게는 아낌없이 베풉니다.",
      "제철 식재료를 밥상에 활용합니다.",
      "일상적이고 기본적인 것을 선호하며, 독창적인 스타일의 제품에는 관심이 적은 편입니다.",
      "품질과 실용성을 중요시 하는 타입으로, 유행에 크게 민감하지 않습니다.",
    ],
  },

  {
    id: 11,
    type: "ESTJ",
    contents: [
      "꼼꼼한 당신의 집에는 물건 떨어질 일이 잘 없습니다.",
      "상품 비교는 나의 힘! 가격부터 품질까지 꼼꼼히 비교합니다.",
      "친구의 계획 없는 소비를 막아줍니다. aka, 지갑지킴이",
      "내가 만족했던 소비가 있다면 주변에 추천합니다.",
    ],
  },

  {
    id: 12,
    type: "ESFJ",
    contents: [
      "쇼핑을 통해 즐거움을 얻는 경우가 많습니다.",
      "사람들과 함께 쇼핑을 하는 것을 즐기는 타입이며, 타인의 의견을 잘 반영합니다.",
      "상품을 구입할 때, 주변 사람들에게 의견을 구합니다.",
      "실용적인 상품에 관심이 많으며, 편안한 것을 선호합니다.",
    ],
  },

  {
    id: 13,
    type: "ISTP",
    contents: [
      "맥시멈은 놉! 필요한 만큼만 적당히 구매합니다.",
      "저비용의 적당한 물건의 가성비보다는 좋은 품질의 상품을 선호합니다.",
      "한 번 마음에 든 상품은 재구매에 재재구매 합니다.",
      "집에 애착 아이템이 많습니다.",
      "실용적이고 기능적인 제품을 선호하며, 가성비와 효율성이 높은 제품을 고르는 편입니다.",
    ],
  },

  {
    id: 14,
    type: "ISFP",
    contents: [
      "예쁜 쓰레기 수집가",
      "내가 사랑하는 사람들에게는 아낌없이 베풉니다.",
      "마트 구경을 하다가 계획에 없는 물건을 사기도 합니다.",
      "쇼핑에 대한 피로도가 높습니다.",
      "온라인 쇼핑을 선호하는 편입니다.",
    ],
  },

  {
    id: 15,
    type: "ESTP",
    contents: [
      "새로운 상품이 나오면 내가 먼저 먹어봅니다.",
      "내 취향이 아니면 쳐다도 보지 않습니다.",
      "물건을 꼼꼼히 따지지않고, 대충 마구마구 담습니다.",
      "이왕 살거면 제일 있어보이는 것으로 구매합니다.",
    ],
  },

  {
    id: 16,
    type: "ESFP",
    contents: [
      "내가 맛있었던 것은 내가 주변 사람들에게도 강력 추천합니다.",
      "먹을 것에 있어서는 아끼지 않습니다.",
      "마트 쇼핑 그 자체로 에너지를 얻습니다.",
      "마트에 있는 모든 것을 하나도 놓치지 않겠다는 기세로 돌아다닙니다.",
      "새로운 아이템에 관심이 많습니다.",
    ],
  },
];

//6개 - random
export const skill = [
  {
    id: 1,
    subTitle: "빨리사면 더 싸진다!",
    title: "선착순 구매",
  },
  {
    id: 2,
    subTitle: "모이면 모일수록 추가 할인!",
    title: "공동 구매",
  },
  {
    id: 3,
    subTitle: "나만 받는 추가 할인!",
    title: "단골마트 할인 쿠폰",
  },
  {
    id: 4,
    subTitle: "비교하면 더 큰 할인!",
    title: "착한 가격 상품 추천",
  },
  {
    id: 5,
    subTitle: "미리 보고 가면 시간 단축!",
    title: "단골마트 행사 전단",
  },
  {
    id: 6,
    subTitle: "1+1, 2+1을 한 눈에!",
    title: "편의점 모아보기",
  },
];
